#从切片操作开始
import numpy as np
a=np.arange(10)
#slice函数和numpy没关系
s=slice(2,7,2)
print(a[s])
c=a[2:7:2]
print(c)
#从下标从2开始到最后
print(a[2:])
#对于多维数组依旧适用,从下标为1开始截取
b=np.array([[1,2,3],[3,4,5],[4,5,6]])
print(b[1:])
#指定列，指定元素，特定元素集合
a = np.array([[1,2,3],[3,4,5],[4,5,6]])
print (a[...,1])   # 第2列元素
print (a[1,...])   # 第2行元素
print (a[...,1:])  # 第2列到当前所在行最后的行元素集合
#高级索引（0，0），（1，1），（2，0）处的元素
x = np.array([[1,  2],  [3,  4],  [5,  6]])
y = x[[0,1,2],  [0,1,0]]
print (y)
#等价写法
x=np.array([[1,2,3],[4,5,6],[7,8,9]])
y=np.array([[0,0],[2,2]])
z=np.array([[0,1],[0,1]])
c=x[y,z]
print(c)
